Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkAttributes Class
 The SectionMarkAttributes class is the attributes class for section marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class SectionMarkAttributes : AttributesBase
<SerializableAttribute>
Public Class SectionMarkAttributes
	Inherits AttributesBase
The SectionMarkBase.SectionMarkAttributes type exposes the following members.
Constructors
Name | Description
SectionMarkBase.SectionMarkAttributes()
 Creates a new default SectionMarkAttributes instance that loads standard attributes.
SectionMarkBase.SectionMarkAttributes(String)
 Creates a new SectionMarkAttributes instance that loads the specified attributes.
Top
Properties
Name | Description
LeftSymbol
 The symbol to use on the left side of the section mark.
LineColor
 The color of the section mark line (see DrawingColors for options).
LineLength
 The length of the section mark lines.
LineLengthOffset
 The offset from the end of the line on both sides of the section mark.
LineWidth
 The width of the section mark lines.
LineWidthOffsetLeft
 The offset from the start of the line on the left side of the section mark.
LineWidthOffsetRight
 The offset from the start of the line on the right side of the section mark.
MarkName
 The section mark name.
RightSymbol
 The symbol to use on the right side of the section mark.
SymbolColor
 The color of the mark symbols (see DrawingColors for options).
TagsAttributes
 The tags A1-A5 in the section mark attributes.
TrueLineColor
 The true color (rgb enabled) of the line.
TrueSymbolColor
 The true color (rgb enabled) of the symbol.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace